<a href="https://colab.research.google.com/github/javilledo/machine-learning/blob/master/notebooks/t04_05_linear_regression_problemas_con_regresi%C3%B3n_lineal.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#TRATAMIENTO DE VARIABLES CATEGÓRICAS

In [157]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.linear_model import LinearRegression

In [158]:
url = 'https://raw.githubusercontent.com/javilledo/python-ml-course/master/datasets/ecom-expense/Ecom%20Expense.csv'
data = pd.read_csv(url)
data.head()

  Transaction ID  Age    Items   ...  Gender  City Tier  Total Spend
0         TXN001    42       10  ...  Female     Tier 1  4198.385084
1         TXN002    24        8  ...  Female     Tier 2  4134.976648
2         TXN003    47       11  ...    Male     Tier 2  5166.614455
3         TXN004    50       11  ...  Female     Tier 1  7784.447676
4         TXN005    60        2  ...  Female     Tier 2  3254.160485

[5 rows x 9 columns]

In [159]:
dummy_gender = pd.get_dummies(data['Gender'], prefix='Gender')
dummy_city_tier = pd.get_dummies(data['City Tier'], prefix='City')

In [160]:
dummy_gender.head()

   Gender_Female  Gender_Male
0              1            0
1              1            0
2              0            1
3              1            0
4              1            0

In [161]:
dummy_city_tier.head()

   City_Tier 1  City_Tier 2  City_Tier 3
0            1            0            0
1            0            1            0
2            0            1            0
3            1            0            0
4            0            1            0

In [162]:
data = data.join(dummy_gender).join(dummy_city_tier)
data.head()

  Transaction ID  Age    Items   ...  City_Tier 1  City_Tier 2  City_Tier 3
0         TXN001    42       10  ...            1            0            0
1         TXN002    24        8  ...            0            1            0
2         TXN003    47       11  ...            0            1            0
3         TXN004    50       11  ...            1            0            0
4         TXN005    60        2  ...            0            1            0

[5 rows x 14 columns]

In [163]:
feature_cols = ['Monthly Income', 'Transaction Time', 'Gender_Female', 'Gender_Male', 'City_Tier 1', 'City_Tier 2', 'City_Tier 3']

In [164]:
X = data[feature_cols]
Y = data['Total Spend']

In [165]:
lm = LinearRegression().fit(X,Y)

In [166]:
print(lm.intercept_)
print(lm.coef_)

3655.729407690652
[   0.15297825    0.12372609  -94.15779883   94.15779883  119.6632516
  -16.67901801 -102.9842336 ]

In [167]:
dict_coefs = zip(feature_cols,lm.coef_) #LOS ZIP CREAN UN ARRAY DE TUPLAS
list(dict_coefs) #OJO QUE LOS ZIP SE LISTAN

[('Monthly Income', 0.15297824609320523),
 ('Transaction Time', 0.1237260864262),
 ('Gender_Female', -94.15779883032013),
 ('Gender_Male', 94.1577988303201),
 ('City_Tier 1', 119.66325160390102),
 ('City_Tier 2', -16.679018007990496),
 ('City_Tier 3', -102.9842335959106)]

In [168]:
lm.score(X,Y)

0.19478920552885381

In [169]:
#como resulta un r2 (score) bastante bajo, vamos a incluir el campo 'Record' en el entrenamiento
feature_cols = ['Monthly Income', 'Transaction Time', 'Gender_Female', 'Gender_Male', 'City_Tier 1', 'City_Tier 2', 'City_Tier 3', 'Record']
X = data[feature_cols]
Y = data['Total Spend']
lm = LinearRegression().fit(X,Y)
dict_coefs = zip(feature_cols,lm.coef_)
list(dict_coefs)
lm.score(X,Y)

0.9179923586131016

In [170]:
data['predict'] = lm.predict(data[feature_cols])
data.head()

  Transaction ID  Age    Items   ...  City_Tier 2  City_Tier 3      predict
0         TXN001    42       10  ...            0            0  4903.696720
1         TXN002    24        8  ...            1            0  4799.434826
2         TXN003    47       11  ...            1            0  5157.082504
3         TXN004    50       11  ...            0            0  8068.012996
4         TXN005    60        2  ...            1            0  3581.980335

[5 rows x 15 columns]

In [171]:
SSD = np.sum((data['predict'] - data['Total Spend'])**2)
SSD

1517733985.3408163

In [172]:
RSE = np.sqrt(SSD/(len(data) - len(feature_cols) - 1))
RSE

803.1318809818165

In [173]:
error = RSE / np.mean(data['Total Spend'])
error

0.13031135680294162